app/controllers/browse_controller.rb

SELECT * FROM "pictures" WHERE ("pictures"."uid" = 1) ORDER BY created_at DESC LIMIT 1
---
  def index
    @pictures = Picture.find(:all, :order => "created_at DESC", :limit => 15)

SELECT * FROM "pictures" WHERE ("pictures"."user_id" = 1) ORDER BY created_at DESC
---
  def manage
    if logged_in?
      @pictures = Picture.find_all_by_user_id(self.current_user.id, :order => "created_at DESC")