app/controllers/pictures_controller.rb

  def terminate
    @picture = Picture.find(params[:id])

    if (self.current_user.id == @picture.user_id)
      @picture.destroy
      errors = get_errors_for(@picture) if !@picture.errors.empty?
---
SELECT * FROM "pictures" WHERE ("pictures"."id" = 1)
DELETE FROM "pictures" WHERE "id" = 1
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def show
    begin
      @picture = Picture.find(params[:id])
---
SELECT * FROM "pictures" WHERE ("pictures"."id" = 1)