app/controllers/tweets_controller.rb

SELECT * FROM "tweets" WHERE ("tweets"."picture_id" = '1')
---
  def show
    @tweets = Tweet.find_all_by_picture_id(params[:id])

SELECT * FROM "pictures" WHERE ("pictures"."id" = 11) LIMIT 1
INSERT INTO "tweets" ("created_at", "updated_at", "user_id", "picture_id", "message") VALUES('2009-05-23 18:34:35', '2009-05-23 18:34:35', 1, 1, NULL)
---
  def create
    p = Picture.find(params[:tweet][:picture_id], :limit => 1)
    if p.nil?
      flash[:notice] = 'invalid picture id'
      redirect_to :root
    end

    @tweet = Tweet.create(
      :message => params[:tweet][:message],
      :user_id => self.current_user.id,
      :picture_id => params[:tweet][:picture_id]
    )