app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('763e5ddcf6221160611620cf0e08ffb5231ea8e5', '2009-05-18 15:38:54', '1391c748894173a134682a4dc500e2ad6de68ebf', NULL, '2009-05-18 15:38:54', NULL, 'khanku', 'khanku')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save